'------------------------------Циклы----------------------------'
# цикл - это конструкция, который повторяет несколько раз 
# есть два вида цикла 
'1. for - цикл который работает с итеруреымым обьектом Цикл заканчивает работу когла доходит до последного элемента итерируемого обеькта'

'2. - цикл который работает до сир пор пока условие верное[True]'

'Итерируемый обьект - какая-то последовательность например: [1, 23, "hi"], "makers", (123, True, 1, 5), dict,set'

'итерация - процесс перебора итерируемого обеьлта (когда мы по очереди вытаскиваем элементы в последовательн'

'-----------------------------------------------'
'FOR'




for letter in 'hello world':
    print(letter)

'--------------------------------------------------------------------------------------------------'
for number in [12, 3, 4, 0, -1, 20]:
    print(number * 2)

list_ = [2, 12, 5, 3]
    
for number in list_:
   print(number ** 2)



text = 'makers' 
for i in text: 
    print(i)

# m
# a
# k
# e
# r
# s
    
list_ = [2, 5, 20, 10, 9, - 1]
for i in list_:
   
    print(i)

# m
# a
# k
# e
# r
# s
    
list_ = [2, 5, 20, 10, 9, - 1]
for i in list_:
   if i % 2 == 0:
    print(i) 

# 2
# 20 
# 10
    
'WHILE'

n = 1 
while n < 10:
   print('hello world')
   n = n + 1

n = 0
while n:
   print('hi')
   n += 1
# Остановливает ваш код в терминале
# ctrl + c
# ctrl + z

'=================================Ключевые слова в циклах==========================='
# break - принудительная остановка цикла
# continue - пропускает итерациюб продолэает со следующей итерации

range() # генератор 

for i in range(1, 11):
   if i == 3:
      continue
   print(i)

# 1
# 2
# 4
# 6
# 6
# 7
# 8 
   
for i in range(11):
   print(i)
   if i == 2:
    break


n = 1
while n < 10:
   n = n + 1
   if n == 2:
      continue
   print(n)

# 3
# ...
# 9
   

n = 0
while n > 10:
   print(n)
   if n < 100:
        break
   
   